getting-started-files/slides.tex
% Created 2010-10-21 Thu 14:35
\documentclass[presentation]{beamer}
\usepackage[latin1]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{t1enc}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage[english]{babel} \usepackage{ae,aecompl}
\usepackage{mathpazo,courier,euler} \usepackage[scaled=.95]{helvet}
\usepackage{listings}
\lstset{language=Python, basicstyle=\ttfamily\bfseries,
commentstyle=\color{red}\itshape, stringstyle=\color{darkgreen},
showstringspaces=false, keywordstyle=\color{blue}\bfseries}
\providecommand{\alert}[1]{\textbf{#1}}

\title{Getting started with files}
\author{FOSSEE}
\date{}

\usetheme{Warsaw}\usecolortheme{default}\useoutertheme{infolines}\setbeamercovered{transparent}
\begin{document}

\maketitle









\begin{frame}
\frametitle{Outline}
\label{sec-1}

\begin{itemize}
\item Opening and reading contents of a file
\item Closing open files
\item Reading all the contents of the file at once
\item Reading files line by line
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Question 1}
\label{sec-2}

  Split the variable into a list, \texttt{pend\_list}, of the lines in the
  file. Hint, use the tab command to see what methods the string
  variable has.
\end{frame}
\begin{frame}[fragile]
\frametitle{Solution 1}
\label{sec-3}

\begin{verbatim}
In []: pend_list = pend.splitlines()

In []: pend_list
\end{verbatim}
\end{frame}
\begin{frame}
\frametitle{Question 2}
\label{sec-4}

  Re-open the file \texttt{pendulum.txt} with \texttt{f} as the file object.
\end{frame}
\begin{frame}[fragile]
\frametitle{Solution 2}
\label{sec-5}

\begin{verbatim}
In []:   f = open('/home/fossee/pendulum.txt')
\end{verbatim}
\end{frame}
\begin{frame}
\frametitle{Summary}
\label{sec-6}

\begin{itemize}
\item Opening a file using \texttt{open} function
\item Reading all the contents of the file at once using \texttt{read()} method
\item Closing open files using the \texttt{close} method
\item Reading files line by line by iterating using a \texttt{for} loop
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Thank you!}
\label{sec-7}

  \begin{block}{}
  \begin{center}
  This spoken tutorial has been produced by the
  \textcolor{blue}{FOSSEE} team, which is funded by the 
  \end{center}
  \begin{center}
    \textcolor{blue}{National Mission on Education through \\
      Information \& Communication Technology \\ 
      MHRD, Govt. of India}.
  \end{center}  
  \end{block}
\end{frame}

\end{document}
